examples/intake-2p1o-hpc/input/case_template/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     rhoCentralFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.5e0;

deltaT          1e-8;

writeControl    adjustable;

writeInterval   1e-3;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           0.1;
maxDeltaT       1e-3; // Maximum allowed timestep

application potentialFoam;

functions
{

    MachNumber
    {
        type            MachNo;
        libs            ("libfieldFunctionObjects.so");
        U               U;          // Velocity field
        p               p;          // Pressure field
        gamma           1.4;        // Specific heat ratio (for air)
        result          Mach;       // Name of the output field
        writeControl    runTime;    // Use physical time for writing
        writeInterval   1e-3;       // Floating-point value is valid here
        log             yes;        // Log the calculation
    }
    
    totalPressure
    {
        type            pressure;
        libs            ("libfieldFunctionObjects.so");
        mode            total;      // Corrected mode for total pressure
        p               p;
        U               U;
        gamma           1.4;        // For air; use T if available instead
        result          p0;         // Output field name
        writeControl    runTime;    // Use physical time for writing
        writeInterval   1e-3;       // Floating-point value is valid here
        log             yes;
    }

    inletTotalPressureAvg
    {
        type            surfaceFieldValue;
        libs            ("libfieldFunctionObjects.so");
        fields          (p0);
        operation       areaAverage;
        regionType      patch;
        name            inlet;      // Replace with your inlet patch name if different
        writeFields     false;      // Required in v2412
        writeControl    runTime;    // Use physical time for writing
        writeInterval   1e-3;       // Floating-point value is valid here
        log             yes;
        surfaceFormat   none;
    }

    exitTotalPressureAvg
    {
        type            surfaceFieldValue;
        libs            ("libfieldFunctionObjects.so");
        fields          (p0);
        operation       areaAverage;
        regionType      patch;
        name            outlet;       // Replace with your exit patch name if different
        writeFields     false;      // Required in v2412
        writeControl    runTime;    // Use physical time for writing
        writeInterval   1e-3;       // Floating-point value is valid here
        log             yes;
        surfaceFormat   none;
    }
}

// ************************************************************************* //

