examples/intake-2p1o-hpc/input/case_template/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5+                                    |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

// Refinements
angle 5;

// Geometry parameters
inletX  -13.623759245514563; // CHANGE ME
inletY  2.697762898834017;  // CHANGE ME
inletZ  0.1;

outletX 0.7741818097404216;  // CHANGE ME
outletY 0.630554673; // CHANGE ME
outletZ 0.1; 

outletX2    5.0;        // CHANGE ME
inletX2     -25;        // CHANGE ME

vertices
(
    // block0 vertices (Intake)
    ($inletX           0           $inletZ)     // 00
    ($inletX           0          -$inletZ)     // 01
    ($inletX           $inletY      $inletZ) // 02 
    ($inletX           $inletY     -$inletZ) // 03
    ($outletX           0           $outletZ)     // 04
    ($outletX           0          -$outletZ)     // 05
    ($outletX           $outletY  $outletZ)    // 06
    ($outletX           $outletY  -$outletZ)    // 07

    // block1 vertices (Extruded outlet)
  //  ($outletX2          0           $outletZ)     // 08
  //  ($outletX2           0          -$outletZ)     // 09
  //  ($outletX2          $outletY  $outletZ)    // 010
   // ($outletX2          $outletY  -$outletZ)    // 011

    // block2 vertices (Extruded inlet)
    ($inletX2           0           $inletZ)     // 012 -8
    ($inletX2           0          -$inletZ)     // 013 -9
    ($inletX2           $inletY     $inletZ) // 14 - 10
    ($inletX2           $inletY     -$inletZ) // 15 - 11
);

edges
(
    spline   6 2
    (
(	0.7741818097404216	0.630554673	$inletZ	)
(	0.7634478360435267	0.6346064105075279	$inletZ	)
(	0.7528412833993507	0.6386187550647929	$inletZ	)
(	0.7423572496237921	0.642592928	$inletZ	)
(	0.7319910419864953	0.6465301228848991	$inletZ	)
(	0.7217381632537557	0.6504315028518218	$inletZ	)
(	0.7115942989007906	0.6542982045140833	$inletZ	)
(	0.7015553053685996	0.658131337	$inletZ	)
(	0.6916171992565129	0.6619319838624729	$inletZ	)
(	0.6817761473550702	0.6657012023025172	$inletZ	)
(	0.6720284574354422	0.6694400255735203	$inletZ	)
(	0.6623705697215527	0.6731494630050632	$inletZ	)
(	0.652799049	0.6768305009757534	$inletZ	)
(	0.6433105771672973	0.6804841037205578	$inletZ	)
(	0.6339019465908248	0.6841112141287513	$inletZ	)
(	0.6245700535245888	0.6877127545304335	$inletZ	)
(	0.6153118922518749	0.6912896274700389	$inletZ	)
(	0.6061245494902625	0.6948427164656592	$inletZ	)
(	0.5970051991686636	0.6983728867533258	$inletZ	)
(	0.5879510975263604	0.7018809860156687	$inletZ	)
(	0.578959579	0.7053678450945946	$inletZ	)
(	0.5700280494254717	0.7088342786878103	$inletZ	)
(	0.5611539868794782	0.7122810860291706	$inletZ	)
(	0.5523349328964261	0.715709052	$inletZ	)
(	0.5435684912870713	0.7191189455422995	$inletZ	)
(	0.5348523241957497	0.7225115247620147	$inletZ	)
(	0.5261841488300677	0.7258875330762555	$inletZ	)
(	0.517561734	0.7292477020513511	$inletZ	)
(	0.5089828989500056	0.7325927515443185	$inletZ	)
(	0.5004455069839744	0.7359233902775301	$inletZ	)
(	0.4919474663534029	0.7392403164000617	$inletZ	)
(	0.48348672591796155	0.7425442180362589	$inletZ	)
(	0.4750612730580241	0.7458357738220778	$inletZ	)
(	0.4666691313345874	0.7491156534297695	$inletZ	)
(	0.4583083582454228	0.7523845180814805	$inletZ	)
(	0.4499770430702646	0.7556430210523472	$inletZ	)
(	0.4416733047983362	0.7588918081636669	$inletZ	)
(	0.4333952901319759	0.7621315182667273	$inletZ	)
(	0.4251411715605328	0.7653627837178713	$inletZ	)
(	0.4169091454990803	0.768586231	$inletZ	)
(	0.40869743048683355	0.7718024804087358	$inletZ	)
(	0.4005042654404649	0.7750121480508754	$inletZ	)
(	0.39232790795779066	0.778215845	$inletZ	)
(	0.38416663266755546	0.781414177	$inletZ	)
(	0.3760187296212708	0.784607748	$inletZ	)
(	0.3678825027232694	0.7877971579883251	$inletZ	)
(	0.3597562681953273	0.7909830024773383	$inletZ	)
(	0.3516383530723721	0.7941658760357662	$inletZ	)
(	0.3435270937259485	0.797346371	$inletZ	)
(	0.3354208344122489	0.8005250767433999	$inletZ	)
(	0.32731792584163794	0.8037025832863348	$inletZ	)
(	0.31921672376670684	0.806879479	$inletZ	)
(	0.31111558758599045	0.8100563501796235	$inletZ	)
(	0.3030128789605616	0.813233786	$inletZ	)
(	0.29490696044079007	0.8164123740980674	$inletZ	)
(	0.2867961941006139	0.8195927033332521	$inletZ	)
(	0.27867894017672407	0.8227753638014819	$inletZ	)
(	0.27055355571010187	0.8259609472062148	$inletZ	)
(	0.2624183931873837	0.8291500472846584	$inletZ	)
(	0.2542717991795494	0.8323432602281197	$inletZ	)
(	0.24611211297544536	0.8355411851058707	$inletZ	)
(	0.23793766520766055	0.8387444242931132	$inletZ	)
(	0.22974677646826974	0.8419535839036427	$inletZ	)
(	0.22153775591195082	0.8451692742278176	$inletZ	)
(	0.21330889984396179	0.8483921101764559	$inletZ	)
(	0.20505849029043863	0.8516227117312899	$inletZ	)
(	0.1967847935484406	0.8548617044026328	$inletZ	)
(	0.1884860587131267	0.8581097196949174	$inletZ	)
(	0.18016051617939655	0.8613673955807939	$inletZ	)
(	0.17180637611527055	0.8646353769844838	$inletZ	)
(	0.16342182690421625	0.8679143162751198	$inletZ	)
(	0.15500503355355244	0.8712048737708098	$inletZ	)
(	0.14655413606597706	0.8745077182541983	$inletZ	)
(	0.13806724777117174	0.8778235275003174	$inletZ	)
(	0.1295424536143314	0.8811529888175521	$inletZ	)
(	0.12097780839835429	0.8844967996025683	$inletZ	)
(	0.1123713349763047	0.8878556679100897	$inletZ	)
(	0.10372102239062445	0.8912303130384357	$inletZ	)
(	0.095024824	0.8946214661317755	$inletZ	)
(	0.086280655	0.8980298708000856	$inletZ	)
(	0.077486392	0.9014562837578387	$inletZ	)
(	0.068639869	0.9049014754824986	$inletZ	)
(	0.059738875	0.9083662308939331	$inletZ	)
(	0.050781154	0.9118513500559127	$inletZ	)
(	0.041764401648468036	0.9153576489009047	$inletZ	)
(	0.032686261189905065	0.91888596	$inletZ	)
(	0.023544323	0.9224371332353287	$inletZ	)
(	0.014336121312612207	0.9260120368082361	$inletZ	)
(	0.005059131	0.9296115578648513	$inletZ	)
(	-0.004289235	0.9332366034603676	$inletZ	)
(	-0.013711627	0.9368881014317298	$inletZ	)
(	-0.023210766	0.9405670013243387	$inletZ	)
(	-0.032789442	0.9442742753539372	$inletZ	)
(	-0.042450519	0.9480109194054841	$inletZ	)
(	-0.05219694	0.9517779540709091	$inletZ	)
(	-0.06203173	0.9555764257277285	$inletZ	)
(	-0.071957999	0.9594074076605943	$inletZ	)
(	-0.081978945	0.9632720012279479	$inletZ	)
(	-0.092097862	0.9671713370760474	$inletZ	)
(	-0.102318141	0.971106576	$inletZ	)
(	-0.112643273	0.9750789122735022	$inletZ	)
(	-0.123076861	0.9790895709922415	$inletZ	)
(	-0.133622618	0.9831398135297573	$inletZ	)
(	-0.144284373	0.9872309370125253	$inletZ	)
(	-0.155066081	0.991364276	$inletZ	)
(	-0.165971825	0.9955412054777013	$inletZ	)
(	-0.177005823	0.99976314	$inletZ	)
(	-0.188172435	1.0040315371840651	$inletZ	)
(	-0.19947617	1.0083479002062556	$inletZ	)
(	-0.210921691	1.0127137779626092	$inletZ	)
(	-0.222513824	1.0171307680876576	$inletZ	)
(	-0.234257568	1.0216005188416435	$inletZ	)
(	-0.2461581	1.026124731293173	$inletZ	)
(	-0.258220783	1.0307051615982854	$inletZ	)
(	-0.270451181	1.035343623	$inletZ	)
(	-0.282855062	1.0400419902152618	$inletZ	)
(	-0.295438412	1.044802198226822	$inletZ	)
(	-0.308207445	1.049626249	$inletZ	)
(	-0.321168614	1.0545162113945903	$inletZ	)
(	-0.334328625	1.0594742265323143	$inletZ	)
(	-0.347694447	1.0645025088487687	$inletZ	)
(	-0.361273327	1.0696033503291045	$inletZ	)
(	-0.375072803	1.0747791236643416	$inletZ	)
(	-0.389100722	1.080032285756222	$inletZ	)
(	-0.403365253	1.0853653813724335	$inletZ	)
(	-0.417874906	1.0907810469571846	$inletZ	)
(	-0.432638546	1.0962820146019263	$inletZ	)
(	-0.447665418	1.1018711161807744	$inletZ	)
(	-0.462965162	1.1075512876548337	$inletZ	)
(	-0.478547836	1.113325573549195	$inletZ	)
(	-0.494423941	1.1191971316057894	$inletZ	)
(	-0.510604438	1.125169237614584	$inletZ	)
(	-0.527100781	1.131245290424718	$inletZ	)
(	-0.543924939	1.1374288171360936	$inletZ	)
(	-0.561089429	1.1437234784706463	$inletZ	)
(	-0.578607338	1.1501330743209377	$inletZ	)
(	-0.596492366	1.156661549471854	$inletZ	)
(	-0.614758849	1.1633129994889728	$inletZ	)
(	-0.633421805	1.170091676764547	$inletZ	)
(	-0.652496964	1.1770019967089742	$inletZ	)
(	-0.672000815	1.1840485440720259	$inletZ	)
(	-0.691950645	1.1912360793739314	$inletZ	)
(	-0.712364587	1.1985695454215235	$inletZ	)
(	-0.733261667	1.206054073879056	$inletZ	)
(	-0.754661857	1.2136949918567965	$inletZ	)
(	-0.77658613	1.2214978284730764	$inletZ	)
(	-0.799056515	1.229468321336951	$inletZ	)
(	-0.822096162	1.2376124228889278	$inletZ	)
(	-0.845729405	1.245936306526218	$inletZ	)
(	-0.869981832	1.2544463724265118	$inletZ	)
(	-0.894880358	1.2631492529703057	$inletZ	)
(	-0.9204533	1.272051817646144	$inletZ	)
(	-0.946730463	1.281161177305743	$inletZ	)
(	-0.973743221	1.290484687616723	$inletZ	)
(	-1.001524613	1.3000299515395988	$inletZ	)
(	-1.030109434	1.3098048206327462	$inletZ	)
(	-1.059534341	1.319817394964417	$inletZ	)
(	-1.089837953	1.3300760213846876	$inletZ	)
(	-1.121060969	1.340589289882828	$inletZ	)
(	-1.153246279	1.3513660277274722	$inletZ	)
(	-1.186439089	1.362415291058855	$inletZ	)
(	-1.220687048	1.3737463535751795	$inletZ	)
(	-1.25604038	1.3853686919301662	$inletZ	)
(	-1.292552023	1.3972919674375748	$inletZ	)
(	-1.330277772	1.4095260036629491	$inletZ	)
(	-1.369276428	1.422080759475433	$inletZ	)
(	-1.409609949	1.4349662971359909	$inletZ	)
(	-1.451343612	1.448192745016025	$inletZ	)
(	-1.494546172	1.4617702545756845	$inletZ	)
(	-1.539290032	1.4757089512878958	$inletZ	)
(	-1.585651412	1.4900188792759474	$inletZ	)
(	-1.633710531	1.504709939542684	$inletZ	)
(	-1.683551779	1.5197918218104602	$inletZ	)
(	-1.735263911	1.535273930164039	$inletZ	)
(	-1.788940238	1.5511653028925183	$inletZ	)
(	-1.844678823	1.5674745271572064	$inletZ	)
(	-1.902582696	1.5842096493624778	$inletZ	)
(	-1.96276007	1.6013780823641788	$inletZ	)
(	-2.025324577	1.6189865108984824	$inletZ	)
(	-2.090395519	1.6370407968321763	$inletZ	)
(	-2.158098149	1.655545885998396	$inletZ	)
(	-2.228563965	1.6745057184629482	$inletZ	)
(	-2.301931054	1.693923144039355	$inletZ	)
(	-2.378344466	1.7137998447131748	$inletZ	)
(	-2.457956633	1.7341362653334567	$inletZ	)
(	-2.540927856	1.7549315534782342	$inletZ	)
(	-2.627426838	1.7761835088131919	$inletZ	)
(	-2.717631294	1.7978885415651085	$inletZ	)
(	-2.811728642	1.8200416389662981	$inletZ	)
(	-2.909916764	1.842636337746111	$inletZ	)
(	-3.012404876	1.8656647000088815	$inletZ	)
(	-3.119414473	1.8891172892007297	$inletZ	)
(	-3.231180398	1.912983142376614	$inletZ	)
(	-3.347952001	1.9372497346640036	$inletZ	)
(	-3.469994429	1.9619029316903354	$inletZ	)
(	-3.597590031	1.9869269257868414	$inletZ	)
(	-3.731039899	2.0123041519719855	$inletZ	)
(	-3.870665556	2.0380151800108215	$inletZ	)
(	-4.016810798	2.0640385791927782	$inletZ	)
(	-4.169843717	2.0903507528202616	$inletZ	)
(	-4.330158915	2.1169257397103016	$inletZ	)
(	-4.498179941	2.1437349802469434	$inletZ	)
(	-4.674361976	2.170747044660369	$inletZ	)
(	-4.859194804	2.197927321238497	$inletZ	)
(	-5.053206107	2.2252376620971774	$inletZ	)
(	-5.256965137	2.252635984	$inletZ	)
(	-5.471086822	2.2800758210827268	$inletZ	)
(	-5.69623637	2.3075058272926476	$inletZ	)
(	-5.93313447	2.3348692234026998	$inletZ	)
(	-6.182563176	2.362103186304252	$inletZ	)
(	-6.445372605	2.389138175366066	$inletZ	)
(	-6.722488595	2.4158971916984613	$inletZ	)
(	-7.014921525	2.4422949657476254	$inletZ	)
(	-7.323776506	2.4682370689732127	$inletZ	)
(	-7.650265265	2.493618946185114	$inletZ	)
(	-7.995720083	2.518324866817996	$inletZ	)
(	-8.361610288	2.5422267965583356	$inletZ	)
(	-8.749561954	2.5651831962325717	$inletZ	)
(	-9.161381662	2.5870377643017393	$inletZ	)
(	-9.599085546	2.607618155495014	$inletZ	)
(	-10.06493527	2.6267347362228426	$inletZ	)
(	-10.5614834	2.644179487439132	$inletZ	)
(	-11.09163174	2.6597252581292343	$inletZ	)
(	-11.65870846	2.6731257533008734	$inletZ	)
(	-12.26657353	2.6841170218189774	$inletZ	)
(	-12.91977017	2.692422107	$inletZ	)
(	-13.62375925	2.697762898834017	$inletZ	)
)

 spline   7 3
    (
(	0.7741818097404216	0.630554673	-$inletZ	)
(	0.7634478360435267	0.6346064105075279	-$inletZ	)
(	0.7528412833993507	0.6386187550647929	-$inletZ	)
(	0.7423572496237921	0.642592928	-$inletZ	)
(	0.7319910419864953	0.6465301228848991	-$inletZ	)
(	0.7217381632537557	0.6504315028518218	-$inletZ	)
(	0.7115942989007906	0.6542982045140833	-$inletZ	)
(	0.7015553053685996	0.658131337	-$inletZ	)
(	0.6916171992565129	0.6619319838624729	-$inletZ	)
(	0.6817761473550702	0.6657012023025172	-$inletZ	)
(	0.6720284574354422	0.6694400255735203	-$inletZ	)
(	0.6623705697215527	0.6731494630050632	-$inletZ	)
(	0.652799049	0.6768305009757534	-$inletZ	)
(	0.6433105771672973	0.6804841037205578	-$inletZ	)
(	0.6339019465908248	0.6841112141287513	-$inletZ	)
(	0.6245700535245888	0.6877127545304335	-$inletZ	)
(	0.6153118922518749	0.6912896274700389	-$inletZ	)
(	0.6061245494902625	0.6948427164656592	-$inletZ	)
(	0.5970051991686636	0.6983728867533258	-$inletZ	)
(	0.5879510975263604	0.7018809860156687	-$inletZ	)
(	0.578959579	0.7053678450945946	-$inletZ	)
(	0.5700280494254717	0.7088342786878103	-$inletZ	)
(	0.5611539868794782	0.7122810860291706	-$inletZ	)
(	0.5523349328964261	0.715709052	-$inletZ	)
(	0.5435684912870713	0.7191189455422995	-$inletZ	)
(	0.5348523241957497	0.7225115247620147	-$inletZ	)
(	0.5261841488300677	0.7258875330762555	-$inletZ	)
(	0.517561734	0.7292477020513511	-$inletZ	)
(	0.5089828989500056	0.7325927515443185	-$inletZ	)
(	0.5004455069839744	0.7359233902775301	-$inletZ	)
(	0.4919474663534029	0.7392403164000617	-$inletZ	)
(	0.48348672591796155	0.7425442180362589	-$inletZ	)
(	0.4750612730580241	0.7458357738220778	-$inletZ	)
(	0.4666691313345874	0.7491156534297695	-$inletZ	)
(	0.4583083582454228	0.7523845180814805	-$inletZ	)
(	0.4499770430702646	0.7556430210523472	-$inletZ	)
(	0.4416733047983362	0.7588918081636669	-$inletZ	)
(	0.4333952901319759	0.7621315182667273	-$inletZ	)
(	0.4251411715605328	0.7653627837178713	-$inletZ	)
(	0.4169091454990803	0.768586231	-$inletZ	)
(	0.40869743048683355	0.7718024804087358	-$inletZ	)
(	0.4005042654404649	0.7750121480508754	-$inletZ	)
(	0.39232790795779066	0.778215845	-$inletZ	)
(	0.38416663266755546	0.781414177	-$inletZ	)
(	0.3760187296212708	0.784607748	-$inletZ	)
(	0.3678825027232694	0.7877971579883251	-$inletZ	)
(	0.3597562681953273	0.7909830024773383	-$inletZ	)
(	0.3516383530723721	0.7941658760357662	-$inletZ	)
(	0.3435270937259485	0.797346371	-$inletZ	)
(	0.3354208344122489	0.8005250767433999	-$inletZ	)
(	0.32731792584163794	0.8037025832863348	-$inletZ	)
(	0.31921672376670684	0.806879479	-$inletZ	)
(	0.31111558758599045	0.8100563501796235	-$inletZ	)
(	0.3030128789605616	0.813233786	-$inletZ	)
(	0.29490696044079007	0.8164123740980674	-$inletZ	)
(	0.2867961941006139	0.8195927033332521	-$inletZ	)
(	0.27867894017672407	0.8227753638014819	-$inletZ	)
(	0.27055355571010187	0.8259609472062148	-$inletZ	)
(	0.2624183931873837	0.8291500472846584	-$inletZ	)
(	0.2542717991795494	0.8323432602281197	-$inletZ	)
(	0.24611211297544536	0.8355411851058707	-$inletZ	)
(	0.23793766520766055	0.8387444242931132	-$inletZ	)
(	0.22974677646826974	0.8419535839036427	-$inletZ	)
(	0.22153775591195082	0.8451692742278176	-$inletZ	)
(	0.21330889984396179	0.8483921101764559	-$inletZ	)
(	0.20505849029043863	0.8516227117312899	-$inletZ	)
(	0.1967847935484406	0.8548617044026328	-$inletZ	)
(	0.1884860587131267	0.8581097196949174	-$inletZ	)
(	0.18016051617939655	0.8613673955807939	-$inletZ	)
(	0.17180637611527055	0.8646353769844838	-$inletZ	)
(	0.16342182690421625	0.8679143162751198	-$inletZ	)
(	0.15500503355355244	0.8712048737708098	-$inletZ	)
(	0.14655413606597706	0.8745077182541983	-$inletZ	)
(	0.13806724777117174	0.8778235275003174	-$inletZ	)
(	0.1295424536143314	0.8811529888175521	-$inletZ	)
(	0.12097780839835429	0.8844967996025683	-$inletZ	)
(	0.1123713349763047	0.8878556679100897	-$inletZ	)
(	0.10372102239062445	0.8912303130384357	-$inletZ	)
(	0.095024824	0.8946214661317755	-$inletZ	)
(	0.086280655	0.8980298708000856	-$inletZ	)
(	0.077486392	0.9014562837578387	-$inletZ	)
(	0.068639869	0.9049014754824986	-$inletZ	)
(	0.059738875	0.9083662308939331	-$inletZ	)
(	0.050781154	0.9118513500559127	-$inletZ	)
(	0.041764401648468036	0.9153576489009047	-$inletZ	)
(	0.032686261189905065	0.91888596	-$inletZ	)
(	0.023544323	0.9224371332353287	-$inletZ	)
(	0.014336121312612207	0.9260120368082361	-$inletZ	)
(	0.005059131	0.9296115578648513	-$inletZ	)
(	-0.004289235	0.9332366034603676	-$inletZ	)
(	-0.013711627	0.9368881014317298	-$inletZ	)
(	-0.023210766	0.9405670013243387	-$inletZ	)
(	-0.032789442	0.9442742753539372	-$inletZ	)
(	-0.042450519	0.9480109194054841	-$inletZ	)
(	-0.05219694	0.9517779540709091	-$inletZ	)
(	-0.06203173	0.9555764257277285	-$inletZ	)
(	-0.071957999	0.9594074076605943	-$inletZ	)
(	-0.081978945	0.9632720012279479	-$inletZ	)
(	-0.092097862	0.9671713370760474	-$inletZ	)
(	-0.102318141	0.971106576	-$inletZ	)
(	-0.112643273	0.9750789122735022	-$inletZ	)
(	-0.123076861	0.9790895709922415	-$inletZ	)
(	-0.133622618	0.9831398135297573	-$inletZ	)
(	-0.144284373	0.9872309370125253	-$inletZ	)
(	-0.155066081	0.991364276	-$inletZ	)
(	-0.165971825	0.9955412054777013	-$inletZ	)
(	-0.177005823	0.99976314	-$inletZ	)
(	-0.188172435	1.0040315371840651	-$inletZ	)
(	-0.19947617	1.0083479002062556	-$inletZ	)
(	-0.210921691	1.0127137779626092	-$inletZ	)
(	-0.222513824	1.0171307680876576	-$inletZ	)
(	-0.234257568	1.0216005188416435	-$inletZ	)
(	-0.2461581	1.026124731293173	-$inletZ	)
(	-0.258220783	1.0307051615982854	-$inletZ	)
(	-0.270451181	1.035343623	-$inletZ	)
(	-0.282855062	1.0400419902152618	-$inletZ	)
(	-0.295438412	1.044802198226822	-$inletZ	)
(	-0.308207445	1.049626249	-$inletZ	)
(	-0.321168614	1.0545162113945903	-$inletZ	)
(	-0.334328625	1.0594742265323143	-$inletZ	)
(	-0.347694447	1.0645025088487687	-$inletZ	)
(	-0.361273327	1.0696033503291045	-$inletZ	)
(	-0.375072803	1.0747791236643416	-$inletZ	)
(	-0.389100722	1.080032285756222	-$inletZ	)
(	-0.403365253	1.0853653813724335	-$inletZ	)
(	-0.417874906	1.0907810469571846	-$inletZ	)
(	-0.432638546	1.0962820146019263	-$inletZ	)
(	-0.447665418	1.1018711161807744	-$inletZ	)
(	-0.462965162	1.1075512876548337	-$inletZ	)
(	-0.478547836	1.113325573549195	-$inletZ	)
(	-0.494423941	1.1191971316057894	-$inletZ	)
(	-0.510604438	1.125169237614584	-$inletZ	)
(	-0.527100781	1.131245290424718	-$inletZ	)
(	-0.543924939	1.1374288171360936	-$inletZ	)
(	-0.561089429	1.1437234784706463	-$inletZ	)
(	-0.578607338	1.1501330743209377	-$inletZ	)
(	-0.596492366	1.156661549471854	-$inletZ	)
(	-0.614758849	1.1633129994889728	-$inletZ	)
(	-0.633421805	1.170091676764547	-$inletZ	)
(	-0.652496964	1.1770019967089742	-$inletZ	)
(	-0.672000815	1.1840485440720259	-$inletZ	)
(	-0.691950645	1.1912360793739314	-$inletZ	)
(	-0.712364587	1.1985695454215235	-$inletZ	)
(	-0.733261667	1.206054073879056	-$inletZ	)
(	-0.754661857	1.2136949918567965	-$inletZ	)
(	-0.77658613	1.2214978284730764	-$inletZ	)
(	-0.799056515	1.229468321336951	-$inletZ	)
(	-0.822096162	1.2376124228889278	-$inletZ	)
(	-0.845729405	1.245936306526218	-$inletZ	)
(	-0.869981832	1.2544463724265118	-$inletZ	)
(	-0.894880358	1.2631492529703057	-$inletZ	)
(	-0.9204533	1.272051817646144	-$inletZ	)
(	-0.946730463	1.281161177305743	-$inletZ	)
(	-0.973743221	1.290484687616723	-$inletZ	)
(	-1.001524613	1.3000299515395988	-$inletZ	)
(	-1.030109434	1.3098048206327462	-$inletZ	)
(	-1.059534341	1.319817394964417	-$inletZ	)
(	-1.089837953	1.3300760213846876	-$inletZ	)
(	-1.121060969	1.340589289882828	-$inletZ	)
(	-1.153246279	1.3513660277274722	-$inletZ	)
(	-1.186439089	1.362415291058855	-$inletZ	)
(	-1.220687048	1.3737463535751795	-$inletZ	)
(	-1.25604038	1.3853686919301662	-$inletZ	)
(	-1.292552023	1.3972919674375748	-$inletZ	)
(	-1.330277772	1.4095260036629491	-$inletZ	)
(	-1.369276428	1.422080759475433	-$inletZ	)
(	-1.409609949	1.4349662971359909	-$inletZ	)
(	-1.451343612	1.448192745016025	-$inletZ	)
(	-1.494546172	1.4617702545756845	-$inletZ	)
(	-1.539290032	1.4757089512878958	-$inletZ	)
(	-1.585651412	1.4900188792759474	-$inletZ	)
(	-1.633710531	1.504709939542684	-$inletZ	)
(	-1.683551779	1.5197918218104602	-$inletZ	)
(	-1.735263911	1.535273930164039	-$inletZ	)
(	-1.788940238	1.5511653028925183	-$inletZ	)
(	-1.844678823	1.5674745271572064	-$inletZ	)
(	-1.902582696	1.5842096493624778	-$inletZ	)
(	-1.96276007	1.6013780823641788	-$inletZ	)
(	-2.025324577	1.6189865108984824	-$inletZ	)
(	-2.090395519	1.6370407968321763	-$inletZ	)
(	-2.158098149	1.655545885998396	-$inletZ	)
(	-2.228563965	1.6745057184629482	-$inletZ	)
(	-2.301931054	1.693923144039355	-$inletZ	)
(	-2.378344466	1.7137998447131748	-$inletZ	)
(	-2.457956633	1.7341362653334567	-$inletZ	)
(	-2.540927856	1.7549315534782342	-$inletZ	)
(	-2.627426838	1.7761835088131919	-$inletZ	)
(	-2.717631294	1.7978885415651085	-$inletZ	)
(	-2.811728642	1.8200416389662981	-$inletZ	)
(	-2.909916764	1.842636337746111	-$inletZ	)
(	-3.012404876	1.8656647000088815	-$inletZ	)
(	-3.119414473	1.8891172892007297	-$inletZ	)
(	-3.231180398	1.912983142376614	-$inletZ	)
(	-3.347952001	1.9372497346640036	-$inletZ	)
(	-3.469994429	1.9619029316903354	-$inletZ	)
(	-3.597590031	1.9869269257868414	-$inletZ	)
(	-3.731039899	2.0123041519719855	-$inletZ	)
(	-3.870665556	2.0380151800108215	-$inletZ	)
(	-4.016810798	2.0640385791927782	-$inletZ	)
(	-4.169843717	2.0903507528202616	-$inletZ	)
(	-4.330158915	2.1169257397103016	-$inletZ	)
(	-4.498179941	2.1437349802469434	-$inletZ	)
(	-4.674361976	2.170747044660369	-$inletZ	)
(	-4.859194804	2.197927321238497	-$inletZ	)
(	-5.053206107	2.2252376620971774	-$inletZ	)
(	-5.256965137	2.252635984	-$inletZ	)
(	-5.471086822	2.2800758210827268	-$inletZ	)
(	-5.69623637	2.3075058272926476	-$inletZ	)
(	-5.93313447	2.3348692234026998	-$inletZ	)
(	-6.182563176	2.362103186304252	-$inletZ	)
(	-6.445372605	2.389138175366066	-$inletZ	)
(	-6.722488595	2.4158971916984613	-$inletZ	)
(	-7.014921525	2.4422949657476254	-$inletZ	)
(	-7.323776506	2.4682370689732127	-$inletZ	)
(	-7.650265265	2.493618946185114	-$inletZ	)
(	-7.995720083	2.518324866817996	-$inletZ	)
(	-8.361610288	2.5422267965583356	-$inletZ	)
(	-8.749561954	2.5651831962325717	-$inletZ	)
(	-9.161381662	2.5870377643017393	-$inletZ	)
(	-9.599085546	2.607618155495014	-$inletZ	)
(	-10.06493527	2.6267347362228426	-$inletZ	)
(	-10.5614834	2.644179487439132	-$inletZ	)
(	-11.09163174	2.6597252581292343	-$inletZ	)
(	-11.65870846	2.6731257533008734	-$inletZ	)
(	-12.26657353	2.6841170218189774	-$inletZ	)
(	-12.91977017	2.692422107	-$inletZ	)
(	-13.62375925	2.697762898834017	-$inletZ	)

)

); 


blocks
(
    // block0
    hex (0 1 3 2 4 5 7 6) (1 90 550) simpleGrading (1 1 -10)

    // block2
    hex (8 9 11 10 0 1 3 2) (1 90 250) simpleGrading (1 1 1)
);


boundary
(
    inlet
    {
        type patch;
        faces
        (
            (8 10 11 9)
        );
    }
    
    outlet
    {
        type patch;
        faces
        (
           (4 6 7 5)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (10 2 3 11)
            (2 6 7 3)
        );
    }

    front
    {
        type empty;
        faces
        (
            (0 4 6 2)
            (8 0 2 10)
        );
    }
    back
    {
        type empty;
        faces
        (
            (1 3 7 5)
            (9 11 3 1)
        );
    }
    bottom
    {
        type symmetryPlane;
        faces
        (
            (0 1 5 4)
            (8 9 1 0)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //