examples/intake-2p1o-hpc/input/case_template/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            hePsiThermo;
    mixture         pureMixture;
    transport       const; // Inviscid transport model
    thermo          hConst;  // Constant specific heat
    equationOfState perfectGas; // Ideal gas law
    specie          specie;
    energy          sensibleInternalEnergy;
}
mixture
{
    specie
    {
        nMoles          1;
        molWeight       28.97; // Molar mass of air in g/mol
    }
    thermodynamics
    {
        Cp              1005; // Specific heat capacity at constant pressure (J/kg·K)
        Hf              0;    // Heat of formation (J/kg)
    }
    transport
    {
        mu      0;      // Dynamic viscosity (Pa·s)
        Pr      1;      // Prandtl number (dimensionless)
    }
}


// ************************************************************************* //

