examples/intake-2p1o-hpc/input/case_template/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "include/initialConditions"

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform $pressureInlet;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform $pressureInlet;
    }
    outlet
    {
         type           waveTransmissive;
        field           p;             
        psi             thermo:psi;     
        gamma           $Y_Air;        
        value           uniform $pressureInlet; 
    }
    walls
    {
        type            zeroGradient;
    }
    #include "include/boundaries"
}


// ************************************************************************* //

