examples/intake-2p1o-hpc/input/case_template/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 0 0 1 0 0 0];

internalField   uniform $T;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform $T;
    }
    outlet
    {
        type            zeroGradient;
    }
    walls
    {
        type           fixedValue;
        value          uniform $Twall;
    }
    #include "include/boundaries"
}

// ************************************************************************* //
