examples/intake-2p1o-hpc/input/case_template/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fluxScheme            Kurganov;

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    div(phi,U)          Gauss limitedLinearV 1;
    div(phi,e)          Gauss limitedLinearV 1;

    div(phi,K)           Gauss limitedLinear 1;
    div(phi,h)           Gauss limitedLinear 1;
    div(phi,T)           Gauss limitedLinear 1;
    div(U)               Gauss limitedLinear 1;
    div(phi,k)           Gauss limitedLinear 1;
    div(phi,epsilon)     Gauss limitedLinear 1;
    div((muEff*dev2(T(grad(U)))))  Gauss limitedLinear 1;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default           linear;
    reconstruct(rho)  vanLeer;
    reconstruct(U)    vanLeerV;
    reconstruct(T)    vanLeer;
}

snGradSchemes
{
    default         corrected;
}
// ************************************************************************* //
